# Вывести первые N чисел кратные M и больше K
numbers = [i for i in range(100+ 1) if not i % 9 and i > 20]
print(numbers[:5])
