# Вывести первые N чисел кратные M и больше K
numbers = [i for i in range(100) if not i % 7 and i > 10]
print(numbers[:5])